#+TITLE: Shishir's Vanilla Emacs Configuration

* Org default Setup
  Change the default settings of org

  #+begin_src emacs-lisp
(setq inhibit-startup-message t)
  (setq org-src-preserve-indentation nil
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)
  (setq org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-confirm-babel-evaluate nil
        org-edit-src-content-indentation 0)
  #+end_src

  #+RESULTS:
  : 0

